emacs/TheWayIUseEmacs.org
#+title: 我是如何使用Emacs的

#+BEGIN_QUOTE
 I would not give a fig for the simplicity on this side of complexity,
 but I would give my life for the simplicity on the other side of complexity.

         -- Oliver Wendell Holmes

#+END_QUOTE

* 从VIM转向Emacs
  03到08年间我一直使用VI做为编辑器，所以对VI的快捷键操作比较熟悉。后来
  由于要学习Common Lisp语言，而Common Lisp强大的开发环境Slime基于Emacs
  编写，因此而开始使用Emacs编辑器。现在我用它来编辑文件，阅读邮件和[[http://zh.wikipedia.org/wiki/GTD][GTD]]管理。

* ELISP介绍
  Emacs的强大之处在于，它的硬件相关代码使用类LISP格式的C语言来完成，
  而大量上层的代码则是由一种解释语言ELisp完成的。ELisp是Lisp的一种方
  言，而Lisp是一种易于扩展的动态语言。Emacs的每个按键，默认都会对应
  elisp中的一个函数。这就允许你可以使用elisp来改变Emacs的所有默认行为。

  elisp语言的语法非常简单，如下：
 - 基本形式

   对一个数学函数f(x,y,z) = f1(x) + f2(y,z) + ...在elisp中为
    #+BEGIN_QUOTE
      (+ (f0 x) (f2 y z) ...)
    #+END_QUOTE
 - 特殊形式
    #+BEGIN_SRC elisp
      'a = (quote a)
    #+END_SRC

* GTD时间管理
** GTD简介
GTD是英文Getting Things Done的缩写，是一种行为管理的方法，也是David Allen写的一本书的书名。

GTD的主要原则在于一个人需要通过记录的方式把头脑中的各种任务移出来。通过这样的方式，头脑可以
不用塞满各种需要完成的事情，而集中精力在正在完成的事情。

我使用Emacs [[http://orgmode.org/][org mode]]来进行GTD管理。


** 三分钟法则
三分钟法则是说，任何可以在三分钟（也可以稍大或稍小，意指比较短的时间
段）内可以完成的事情，就迅速把它完成。生活中许多的小事都属于这一类。

** 添加默认任务
   在org文件的任务项下添加下列行，当执行函数org-agenda后，该任务就会成为
   默认任务。
#+BEGIN_SRC elisp
%%(progn (org-clock-mark-default-task) nil)
#+END_SRC

** 没有clock in任务时在状态栏提醒
  emacs org mode支持对一个任务进行clock in/out的操作，并在状态栏显示
  clock in的任务。而我希望在尽可能的时间都能clock in一个具体的任务，以
  便始终高效地处理问题。因此对org mode进行了扩展，当没有clock in的
  任务时，状态栏会以醒目的颜色显示一个"NO CLOCK"的提示信息。
  方法如下：

 - 创建一个idle.org文件，内容如下：
    <src>
    * *NO TASK*
    This heading is used by keeping clocks is always opening.
    %%(progn (xjt/org-clock-mark-idle-task) nil)
    
    # Local Variables: ***
    # buffer-save-without-query : t ***
    # End: ***
    #+END_SRC

 - 在Emacs启动时执行如下代码
    #+BEGIN_SRC elisp
    (defvar *org-clock-idle-task* nil)
    (defvar *org-clock-idle-quit* nil)
    (defun xjt/org-clock-mark-idle-task ()
      "Mark current task as idle task."
      (interactive)
      (save-excursion
        (org-back-to-heading t)
        (setq *org-clock-idle-task* (make-marker))
        (move-marker *org-clock-idle-task* (point))))
    
    (defun xjt/clock-to-idle-maybe ()
      (unless org-clock-clocking-in
        (when (and (not *org-clock-idle-quit*)
                   *org-clock-idle-task*)
          (save-excursion
            (with-current-buffer (marker-buffer *org-clock-idle-task*)
              (goto-char (marker-position *org-clock-idle-task*))
              (org-clock-in))))))
    (add-hook 'org-clock-out-hook 'xjt/clock-to-idle-maybe 'append)
    
    (org-copy-face 'modeline 'org-mode-line-clock-idle
      "Face used for clock display for idle tasks in mode line."
      :background "IndianRed3")
    (defadvice org-clock-update-mode-line (around xjt/org-clock-update-mode-line)
      (if (string= "*NO TASK*" org-clock-heading)
        (progn
          (setq org-mode-line-string (org-propertize "*NO TASK*" 'face 'org-mode-line-clock-idle))
          (force-mode-line-update))
        ad-do-it))
    (ad-activate 'org-clock-update-mode-line)
    
    (defadvice org-clock-save (before xjt/org-clock-idle-save)
      (setq *org-clock-idle-quit* t)
      (when (string= "*NO TASK*" org-clock-heading)
        (org-clock-out)
        (with-current-buffer "idle.org"
        (save-buffer))))
    (ad-activate 'org-clock-save)
    #+END_SRC

 - 最后，执行如下代码就会使org mode在没有clock in任务时在状态栏显示提醒信息。
  （"D"是我自定义的Daily agenda view）
    #+BEGIN_SRC elisp
      (let ((org-agenda-files (append org-agenda-files (list (concat org-directory "idle.org")))))
        (org-agenda nil "D")
        (xjt/clock-to-idle-maybe))
    #+END_SRC
** 让其他人了解自己的工作进展
我会将自己制作的GTD列表导出到html中，这样别人就可以通过WEB网站了解我的工作安排与工作进展。
如果某项工作不需要导出到html中，只需要将该项工作列表的tag设置为noexport即可。

; ** APPT
; - my-daily-appt
; ** html publish 让其他人更好地了解我的工作
; ** 核查清单
* 收发邮件

** 一次性收取多个邮箱的邮件
我使用Emacs [[http://mew.org][mew]]来收发邮件，由于有多个邮箱帐户，因此扩展了mew来一次性接
收多个邮箱的邮件，方法如下：
#+BEGIN_SRC elisp
;;; utils to retrieve all accounts mails.
(defvar my-mew-cases '("default" "hotmail" "ixiaozhushou.com" "jingtao.net"))
(defvar my-mew-orig-case "default")
(defvar my-mew-current-caselist my-mew-cases)
(defun my-mew-summary-set-case (case)
  "Set the case."
  (setq mew-case case)
  (let ((case mew-case)) ;; side effect
    (save-excursion
      (dolist (buf mew-buffers)
        (when (get-buffer buf)
          (set-buffer buf)
          (cond
            ((mew-summary-p)
             (mew-summary-mode-name mew-mode-name-summary))
            ((mew-virtual-p)
             (mew-summary-mode-name mew-mode-name-virtual))))))
    (when mew-visit-inbox-after-setting-case
      (let ((inbox (mew-case-folder
                    case
                    (mew-proto-inbox-folder (mew-proto case) case))))
        (mew-summary-visit-folder inbox)))))
(defun my-mew-summary-retrieve-all ()
  (interactive)
  (setq my-mew-orig-case mew-case)
  (my-mew-summary-set-case (car my-mew-cases))
  (setq my-mew-current-caselist (cdr my-mew-cases))
  (mew-summary-retrieve))
(defadvice mew-net-disp-info-display (after my-cache-save-postfix-action)
  (sleep-for 2)
  (cond (my-mew-current-caselist
         (my-mew-summary-set-case (car my-mew-current-caselist))
         (setq my-mew-current-caselist (cdr my-mew-current-caselist))
         (mew-summary-retrieve))
        (my-mew-orig-case
         (sleep-for 2)
         (message "retrieve all accounts done.") 
         (my-mew-summary-set-case my-mew-orig-case)
         (setq my-mew-orig-case nil))))
(ad-activate 'mew-net-disp-info-display)
(define-key mew-summary-mode-map "I"    'my-mew-summary-retrieve-all)
#+END_SRC

