emacs/TheWayIUseEmacs.html
<div id="outline-container-org990da73" class="outline-3">
<h3 id="org990da73">使mew能够发送中文名的附件</h3>
<div class="outline-text-3" id="text-org990da73">
<p>
如果使用Outlook(gmail则没有个问题)来接收mew发出的邮件，会发现不能识别中文附件名。下面的补
丁可以解决这个问题。
</p>

<div class="org-src-container">
<pre class="src src-elisp"><code>(defvar *mew-header-encoding-method* :rfc2047)
(defun mew-header-insert (key value &amp;optional no-fold)
  (if (and value (stringp key))
      (let ((beg (point)) params med parname parval)
	(when (listp value)
	  (setq params (cdr value))
	  (setq value (car value)))
	(insert key)
	(insert " ")
	(setq med (point))
	(if (string-match "^[\t -~]*$" value)
	    (insert value)
	  (mew-header-encode-text value nil (length key)))
	(dolist (par params)
	  (mew-set '(parname parval) par)
	  (insert ";")
	  (cond
	   ((string-match "^[-a-zA-Z0-9]+$" parval)
	    ) ;; do nothing
	   ((and (string= (mew-charset-guess-string parval) mew-us-ascii)
		 (not (string-match "\"" parval)))
	    (setq parval (concat "\"" parval "\"")))
	   (t
            (case *mew-header-encoding-method*
              (:rfc2047
               (when (loop for c across parval
                        thereis (&gt; c 255))
                 (setq parval (concat "\"" (rfc2047-encode-string parval)
                                      "\""))))
              (t (setq parval (mew-param-encode parval))
                 (setq parname (concat parname "*"))))))
	  (insert " " parname "=" parval))
	(insert "\n")
	(unless no-fold
	  (mew-header-fold-region beg (point) med)))))
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orged9f2e4" class="outline-2">
<h2 id="orged9f2e4">目录浏览</h2>
<div class="outline-text-2" id="text-orged9f2e4">
</div>
<div id="outline-container-org7877fde" class="outline-3">
<h3 id="org7877fde">根据文件后缀名使用不同程序打开文件</h3>
<div class="outline-text-3" id="text-org7877fde">
<p>
Emacs的Dired模式支持文件管理。在Linux下通过绑定Ctrl-Enter键来根据文件
后缀自动打开各种类型的文件，下面的配置能自动打开doc文件，pdf文件，图片
文件等。（需要安装Wine及相关的软件）
</p>
<div class="org-src-container">
<pre class="src src-elisp"><code>(require 'dired)
  (require 'dired-tar)
  (GNULinux ; gnome-open
   (defvar *open-with-wine* '("wine" "start" "/Unix"))
   (setq *dired-extention-open-list*
         `(("pdf$" "/opt/bin/acroread")
           ("htm$" "google-chrome")
           ("html$" "google-chrome")
           ("doc$" ,@*open-with-wine*)
           ("docx$" ,@*open-with-wine*)
           ("exe$" ,@*open-with-wine*)
           ("ps$" "gsview")))
   (require 'dired-extension)
   (eval-after-load "dired"
     '(progn
        (define-key dired-mode-map [C-return] 'my-dired-open-file)
        (define-key dired-mode-map [menu-bar immediate dired-run-associated-program]
          '("Open Associated Application" . dired-gnome-open-file)))))

;;;###autoload
(defun my-dired-open-file ()
  "Dired find file function. Open file use another tool"
  (interactive)
  (dolist (file (dired-get-marked-files))
    (my-dired-open-file-internal file)))

(defvar *use-doc-view* nil)
(defvar *dired-extention-open-list* nil)
;;;###autoload
(defun my-dired-open-file-internal (file)
  "Open diversified format FILE."
  (interactive "fFile: ")
  (require 'emms)
  (let ((file-extension (file-name-extension file)))
    (if file-extension
        (cond ((string-match "\\(s?html?\\)$" file-extension)
               (require 'w3m)
               (w3m-copy-buffer)
               (message "%s" file)
               (w3m-find-file file))
              ((string-match "\\(chm\\)$" file-extension)
               (require 'chm-view)
               (chm-view-file file))
              ((string-match "\\(bmp\\|ico\\|png\\|jpg\\|jpeg\\|tiff\\)$" file-extension)
               (shell-command
                (concat "wine /home/jingtao/.wine/drive_c/Program\\ Files/IrfanView/i_view32.exe"
                        " `winepath -w " file "` &amp;")))
              ((and *use-doc-view*
                    (string-match "\\(pdf\\|ps\\|dvi\\)$" file-extension))
               (require 'doc-view)
               (dired-view-file)
               (doc-view-mode))
              ((let ((temp (emms-player-get
                            (emms-player-for
                             (emms-playlist-current-selected-track)) 'regex)))
                 (and temp (string-match temp file)))
               (emms-add-file file)
               (with-current-emms-playlist
                 (goto-char (point-max))
                 (forward-line -1)
                 (emms-playlist-mode-play-smart)))
              (t
               (let ((match (find-if #'(lambda (x)
                                         (string-match (car x) file-extension))
                                     *dired-extention-open-list*)))
                 (if match
                     (my-open-external-progam-in-emacs
                      "*dired open*"
                      (if (&lt; 1 (length (cdr match)))
                          (append (cdr match) (list file))
                        (list (cadr match)
                              file)))
                   (find-file file)))))))))
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org474c9dc" class="outline-2">
<h2 id="org474c9dc">像使用VI一样使用Emacs</h2>
<div class="outline-text-2" id="text-org474c9dc">
<p>
Emacs编辑器的默认按键需要大量使用组合键，特别是Ctrl键，时间长了左小
手指会很受伤，而我特别习惯于VI的快捷键，在网上查询后发现了Emacs
的一个VI插件<a href="http://www.emacswiki.org/emacs/ViperMode">viper</a>，现在我的Emacs编辑器就是大量基于viper来使用的，在
大部分的情况下，我会使用VI的快捷键来操作Emacs，只在很少数的情况下会
使用Emacs自带的快捷键。
</p>
</div>
<div id="outline-container-orgb6344da" class="outline-3">
<h3 id="orgb6344da">全局快捷键以z开头</h3>
<div class="outline-text-3" id="text-orgb6344da">
<p>
  一些在所有buffer都需要执行的快捷键我称之为全局快捷键，比如切换
buffer，文件保存等操作。全局快捷键的设置存储在变量
*viper-basic-mode-z-based-maps*中
</p>
<div class="org-src-container">
<pre class="src src-elisp"><code>;;in viper mode &amp; some other modes,use z as my custom command prefix.
(defvar *viper-basic-mode-z-based-maps* nil)
(setq *viper-basic-mode-z-based-maps*
        `(
          ("0" delete-window)
          ("1" delete-other-windows)
          ("2" split-window-vertically)
          ("b" ido-switch-buffer)
          ("c" comment-region)
          ("u" uncomment-region)

          ("f" ido-find-file)
          ("i" my-insert)
          ("j" idomenu)
          ("k" kill-current-buffer)

          ("A" org-agenda)
          ("D" kid-cl-speaker)
          ("S" my-save-buffers)
          ("N" tabbar-forward-group)
          ("P" tabbar-backward-group)
          ("Q" save-buffers-kill-terminal)
          ))
(defmacro apply-viper-z-map (&amp;rest body)
  `(loop for (char action) in *viper-basic-mode-z-based-maps*
      do ,@body))
(defmacro apply-viper-z-keymap (map-name)
  `(loop for (char action) in *viper-basic-mode-z-based-maps*
      do (ignore-errors (define-key ,map-name (concat "z" char) action))))

(with-my-hook 'org-mode-hook
  (org-defkey org-agenda-mode-map "z" nil)
  ;; map original key "z" to "zz" in org agenda mode.
  (org-defkey org-agenda-mode-map "zz" 'org-agenda-add-note)
  (apply-viper-z-map (org-defkey org-agenda-mode-map (concat "z" char) action)))

(define-key viper-vi-basic-map "z" nil) ; delete `viper-nil' binding
(apply-viper-z-keymap viper-vi-basic-map)
</code></pre>
</div>
</div>
<div id="outline-container-org3a96753" class="outline-4">
<h4 id="org3a96753">ze全局操作外部命令相关</h4>
<div class="outline-text-4" id="text-org3a96753">
<div class="org-src-container">
<pre class="src src-elisp"><code>;; use ze as external &amp; enlish invoke
("ec" my-external-program)
("eb" my-bash-shell)
("ed" kid-star-dict)
("eD" kid-sdcv-to-buffer)
("em" compile)
("ep" my-plink)
("es" dos-shell)


</code></pre>
</div>
</div>
</div>
<div id="outline-container-org0231ece" class="outline-4">
<h4 id="org0231ece">zd全局操作目录相关</h4>
<div class="outline-text-4" id="text-org0231ece">
<div class="org-src-container">
<pre class="src src-elisp"><code>;;use zd as dired invoke.
("db" my-dired-buffers)
("dj" dired-jump)
("df" my-traverse-deep-rfind)
("dg" my-dired-go)
("do" dired-jump)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org85670ef" class="outline-4">
<h4 id="org85670ef">zw全局操作w3m相关</h4>
<div class="outline-text-4" id="text-org85670ef">
<div class="org-src-container">
<pre class="src src-elisp"><code>;;use w as w3m prefix 
("wb" my-w3m-buffers)
("ws" w3m-browse-url-new-session)
("wq" my-google-search)
("wg" w3m-browse-url)
</code></pre>
</div>
</div>
</div>
