emacs/TheWayIUseEmacs.html
<div id="outline-container-orgf18c436" class="outline-4">
<h4 id="orgf18c436">zg全局操作org mode</h4>
<div class="outline-text-4" id="text-orgf18c436">
<div class="org-src-container">
<pre class="src src-elisp"><code>;; use zg as org-mode prefix
("g " org-table-edit-field)
("ga" my-org-agenda-buffer)
("gA" org-agenda)
("gb" org-switchb)
("gcd" org-clock-mark-default-task)
("gci" my-org-clock-in)
("gco" org-clock-out)
("gcj" my-org-clock-goto)
("gcJ" my-org-recent-clock)
("gC" org-columns)
("ge" org-set-effort)
("gE" org-clock-modify-effort-estimate)
("gd" org-decrypt-entry)
("gl" org-store-link)
("gg" org-ctrl-c-ctrl-c)
("gi" org-insert-link)
("go" org-open-at-point)
("gr" org-remember)
("gs" org-schedule)
("gS" org-archive-to-archive-sibling);org-advertized-archive-subtree
("gt" org-todo)
("gT" tea-time)
("gu" org-update-statistics-cookies)
("gp" links)

</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgae625d4" class="outline-4">
<h4 id="orgae625d4">zm全局操作个人定制(my)</h4>
<div class="outline-text-4" id="text-orgae625d4">
<div class="org-src-container">
<pre class="src src-elisp"><code>;;use m as my prefix
("mb" bookmark-set)
("md" my-sql-pool)
("mD" diff-buffer-with-file)
("mc" calendar)
("me" emms)
("mf" my-bookmark-jump-via-ido)
("mh" highlight-regexp)
("mH" hi-lock-unface-buffer)
("mj" my-bookmark-jump-via-ido)
("ml" w3m-external-view-this-url)
("mL" my-browser-url)
("mk" browse-kill-ring)
("mm" my-favorite-menubar)
("mn" my-rss)
("mo" find-file-at-point)
("mp" my-plink)
("mt" xjt-create/switch-scratch)
("ms" find-file-recursively)
("mv" my-virsh)
("my" my-eye-save)
("n" tabbar-forward-tab)
("p" tabbar-backward-tab)
("q" my-w3m-google-search)
("o" other-window)
("r" ido-recentf-open)
("s" save-buffer)

</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgdf0770d" class="outline-4">
<h4 id="orgdf0770d">zh全局操作帮助相关</h4>
<div class="outline-text-4" id="text-orgdf0770d">
<div class="org-src-container">
<pre class="src src-elisp"><code>("ha" apropos)
("hf" describe-function)
("hv" describe-variable)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgea46370" class="outline-4">
<h4 id="orgea46370">zv全局操作VC(version control)相关</h4>
<div class="outline-text-4" id="text-orgea46370">
<div class="org-src-container">
<pre class="src src-elisp"><code>;; use zv as version control prefix
("vd" my-ediff-revision)
("vD" ediff-revision)
("vm" magit-status)
("vv" vc-next-action)
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga840f48" class="outline-3">
<h3 id="orga840f48">不同mode的快捷键以s开头</h3>
<div class="outline-text-3" id="text-orga840f48">
<p>
以c/c++ mode为例：
</p>
<div class="org-src-container">
<pre class="src src-elisp"><code>(setq my-cc-modified-vi-map
      (let ((map (make-sparse-keymap)))
        (viper-special-defkey map "b" 'semantic-ia-fast-jump-back)
        (viper-special-defkey map "df" 'my-cc-function-header)
        (viper-special-defkey map "dc" 'my-cc-variable-header)
        (viper-special-defkey map "dv" 'my-cc-variable-header)
        (viper-special-defkey map "f" 'my-toggle-selective-display)
        ;; (viper-special-defkey map "fa" 'semantic-tag-folding-fold-all)
        ;; (viper-special-defkey map "fi" 'semantic-tag-folding-fold-block)
        ;; (viper-special-defkey map "fo" 'semantic-tag-folding-show-block)
        ;; (viper-special-defkey map "ft" 'global-semantic-tag-folding-mode)
        ;; (viper-special-defkey map "fu" 'semantic-tag-folding-show-all)
        (viper-special-defkey map "g" 'proj-gtags)
        (viper-special-defkey map "h" 'sourcepair-load);c-open-relational-file
        (viper-special-defkey map "i" 'semantic-analyze-proto-impl-toggle)
        (viper-special-defkey map "j" 'my-gtags-find-tag)
        (viper-special-defkey map "eg" 'next-error)
        (viper-special-defkey map "mc" 'viss-bookmark-clear-all-buffer)
        (viper-special-defkey map "mi" 'viss-bookmark-toggle)
        (viper-special-defkey map "mt" 'viss-bookmark-toggle)
        (viper-special-defkey map "mo" 'viss-bookmark-toggle)
        (viper-special-defkey map "mp" 'viss-bookmark-prev-buffer)
        (viper-special-defkey map "mn" 'viss-bookmark-next-buffer)
        (viper-special-defkey map "sa" 'cscope-set-initial-directory)
        (viper-special-defkey map "sc" 'cscope-find-functions-calling-this-function)
        (viper-special-defkey map "sC" 'cscope-find-called-functions)
        (viper-special-defkey map "sf" 'cscope-find-this-file)
        (viper-special-defkey map "sg" 'cscope-find-global-definition-no-prompting)
        (viper-special-defkey map "sG" 'cscope-find-global-definition)
        (viper-special-defkey map "si" 'cscope-find-files-including-file)
        (viper-special-defkey map "sI" 'cscope-index-files)
        (viper-special-defkey map "ss" 'cscope-find-this-symbol)
        (viper-special-defkey map "su" 'cscope-pop-mark)
        (viper-special-defkey map ";" 'c-toggle-auto-newline)
        map))
(viper-modify-major-mode 'c-mode 'vi-state my-cc-modified-vi-map)
(viper-modify-major-mode 'c++-mode 'vi-state my-cc-modified-vi-map)
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf3e37cf" class="outline-2">
<h2 id="orgf3e37cf">智能化</h2>
<div class="outline-text-2" id="text-orgf3e37cf">
</div>
<div id="outline-container-orgcb9b461" class="outline-3">
<h3 id="orgcb9b461">buffer切换</h3>
<div class="outline-text-3" id="text-orgcb9b461">
<p>
Emacs中经常会打开太多的buffer，因此我在切换buffer时，会使用不同的快捷
键，来显示不同类型的buffer，并从中进行选择，比如：
</p>

<ul class="org-ul">
<li>"zgb" ==&gt; 打开org mode的buffer</li>
<li>"zdb" ==&gt; 打开dired mode的buffer(即目录相关的buffer)</li>
<li>"zwb" ==&gt; 打开w3m mode的buffer</li>
</ul>
</div>
</div>
