emacs/TheWayIUseEmacs.org
** 基于my-select-windows的便捷列表选择
使用Emacs命令时经常要从一组列表(命令)中选择一项进行操作。我创建了一个函数
my-select-windows，会自动根据列表中的字符串生成不同的快捷键，用户只需
按下一个键，而不需要按额外的回车键就可以选中它。函数实现为：
#+BEGIN_SRC elisp
;;;###autoload
(defun my-select-window (list &optional prompt nodelay-select)
  "Select a cmd with its prefix key."
  (interactive)
  (when (null list)
    (error "%s: list is empty" (if prompt prompt "Error in my-select-window")))
  (if (= 1 (length list))
      (car list)
    (let ((list (my-string-shortcuts list)))
      (if (and
           (not nodelay-select)
           (setq rpl (read-char-exclusive "" nil 1))
           (assoc rpl list))
          (cdr (assoc rpl list))
        (save-window-excursion
          (org-switch-to-buffer-other-window
           (get-buffer-create "*String to Select*"))
          (erase-buffer)
          (insert (org-add-props (concat (or prompt "String to select") "\n")
                      nil 'face 'bold))
          (loop for (k . s) in list
                do (insert (format "[%c] %s\n" k s)))
          (org-fit-window-to-buffer)
          ;;FIXME: how to make window height suitable for display.
          (enlarge-window (window-height))
          (message (or prompt "Select one from list:"))
          (setq rpl (read-char-exclusive))
          (bury-buffer "*String to Select*")
          (cond
           ((eq rpl 27) nil); 27 <==> Escape
           ((assoc rpl list) (cdr (assoc rpl list)))
           (t (error "Invalid task choice %c" rpl))))))))
;;;###autoload
(defun test-my-select-window ()
  (interactive)
  (let* ((cmds '("aaaa" "bbcd" "ccdb" "dbde"))
         (result (my-select-window cmds)))
    (message result)))
;;;###autoload
(defun my-string-shortcuts (list)
  (require 'tmm)
  (let ((tmm-short-cuts))
    (tmm-add-shortcuts (mapcar #'list list))
    (loop for s in list
          for k in tmm-short-cuts
          collect (cons k s))))
#+END_SRC
举例如下：

 - 快捷键"zi"实现快速插入

   当你按下"zi"时，会等待一秒钟让你输入一个字母来决定要插入什么内容，如果1秒钟内你没有输入
任何内容或输入错了，就会弹出一个buffer提示快捷键并让你继续输入：
<src>
type to insert:
[c] calc
[f] file
[u] userid
[d] date
[t] time
[s] shell command
#+END_SRC
按下c就会插入一个计算式的结果，按下u就会插入用户名。


这样，当你想插入日期时，只需在VI模式下按下"zid"就可以了。

同样，当我想对当前Emacs中的org项目进行publish操作时，输入"sp"就会弹出一个buffer，
让你选择想pubish的项目，如果你记得项目对应的快捷字母是'c'，直接输入c就不会出现
快捷键列表，而会直接对选中的项目进行publish操作。

这个函数可以用在许多地方，让你不需要额外的快捷键就可以处理包含多种情况的问题。

[[http://www.emacswiki.org/emacs/Anything][Anything]] 插件在处理列表时功能更强大，而这里的my-select-window则更便捷。

* 优化工作流程

** 在任务栏显示提示信息

  当Emacs中有需要提醒的消息时，我会在任务栏显示一个Emacs图标来提醒自己。
Emacs图标的显示是通过python脚本[[https://github.com/jingtaozf/dummy/blob/master/etc/trayicon-appt.py][trayicon-appt.py]]来完成的。
<src  lang="elisp">
(defun my-systray-notification (text &optional hour-low-limit hour-high-limit)
  (when (not (eq :x61 my-place))
    (let ((cur-week (parse-integer (format-time-string "%w"))))
      (case cur-week
        ((or 1 2 3 4 5)
         (block my-systray-notification
           (when (and hour-high-limit hour-low-limit (< hour-low-limit hour-high-limit))
             (let ((cur-hour (parse-integer (format-time-string "%H"))))
               (if (or (< cur-hour hour-low-limit)
                       (> cur-hour hour-high-limit))
                 (return-from my-systray-notification))))
           (my-open-external-progam-in-emacs
            "trayicon" (list (my-etc "trayicon-appt.py") text))))))))

#+END_SRC

** 隐藏一些后台处理用的buffer 
#+BEGIN_SRC elisp
(setq *tabbar-ignore-buffers* '("idle.org" ".bbdb" "diary"))
(setq tabbar-buffer-list-function
             (lambda ()
               (remove-if
                (lambda (buffer)
                  (and (not (eq (current-buffer) buffer)) ; Always include the current buffer.
                       (loop for name in *tabbar-ignore-buffers* ;remove buffer name in this list.
                          thereis (string-equal (buffer-name buffer) name))))
                (buffer-list))))
#+END_SRC

# ** 在emacs中操作virsh
# 在工作中我经常使用virsh来管理多台机器上的虚机。因此编写了一个
# [[./site-lisp/virsh.el][virsh.el]]
# 来简化虚机的创建，销毁，VNC显示的操作。这使用了my-select-windows函数来
# 帮助我快速选中需要操作的物理机，虚机及想进行的操作。
# ** [[./site-lisp/kindlegen.el][kindlegen.el]]
# 手中有一台kindle电子书，而kindle对txt格式的文件支持并不好，对mobi格式
# 的文件则支持的非常好。因此，我根据网上的资料编写了一个emacs脚本来从txt文
# 件生成mobi，并可在生成前进行mobi的目录预览。
* Emacs的缺点
** Emacs是单线程的
虽然现在的大多数common lisp实现都支持多线程，但Emacs目前仍然只支持单线
程。这意味着当某个操作需要大量时间才能完成时，Emacs会失去反应，不能响
应任何键盘和鼠标操作。这经常会出现在你使用gnus收发邮件组，使用tramp访
问网络连通不好的远程机器时。
